{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "layer": {"config": {"data_format": "channels_last", "kernel_constraint": null, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 16, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [5, 5], "trainable": true, "use_bias": true}, "class_name": "Conv2D"}, "name": "time_distributed_1", "trainable": true, "batch_input_shape": [null, 8, 28, 28, 1]}, "class_name": "TimeDistributed"}, {"config": {"layer": {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, "name": "time_distributed_2", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"dtype": "float32", "layer": {"config": {"data_format": "channels_last", "kernel_constraint": null, "padding": "same", "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [3, 3], "trainable": true, "use_bias": true}, "class_name": "Conv2D"}, "name": "time_distributed_3", "trainable": true, "batch_input_shape": [null, 8, 28, 28, 1]}, "class_name": "TimeDistributed"}, {"config": {"layer": {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, "name": "time_distributed_4", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"layer": {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, "name": "time_distributed_5", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"unroll": false, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "go_backwards": false, "return_sequences": true, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.5, "units": 512, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 0, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "gru_1"}, "class_name": "GRU"}, {"config": {"unroll": false, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "go_backwards": false, "return_sequences": true, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dropout": 0.5, "units": 512, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 0, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "gru_2"}, "class_name": "GRU"}, {"config": {"dtype": "float32", "layer": {"config": {"bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "units": 197}, "class_name": "Dense"}, "name": "time_distributed_6", "trainable": true, "batch_input_shape": [null, 8, 512]}, "class_name": "TimeDistributed"}], "class_name": "Sequential", "keras_version": "2.0.4"}