{
  "backend": "tensorflow",
  "keras_version": "2.0.4",
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "TimeDistributed",
      "config": {
        "name": "time_distributed_1",
        "dtype": "float32",
        "batch_input_shape": [
          null,
          8,
          28,
          28,
          1
        ],
        "trainable": true,
        "layer": {
          "class_name": "Conv2D",
          "config": {
            "dilation_rate": [
              1,
              1
            ],
            "bias_constraint": null,
            "bias_regularizer": null,
            "kernel_size": [
              5,
              5
            ],
            "activity_regularizer": null,
            "kernel_regularizer": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "seed": null,
                "mode": "fan_avg",
                "scale": 1.0,
                "distribution": "uniform"
              }
            },
            "name": "conv2d_1",
            "dtype": "float32",
            "data_format": "channels_last",
            "batch_input_shape": [
              null,
              28,
              28,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "activation": "relu",
            "trainable": true,
            "use_bias": true
          }
        }
      }
    },
    {
      "class_name": "TimeDistributed",
      "config": {
        "name": "time_distributed_2",
        "layer": {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [
              2,
              2
            ],
            "name": "max_pooling2d_1",
            "data_format": "channels_last",
            "padding": "valid",
            "trainable": true,
            "strides": [
              2,
              2
            ]
          }
        },
        "trainable": true
      }
    },
    {
      "class_name": "TimeDistributed",
      "config": {
        "name": "time_distributed_3",
        "dtype": "float32",
        "batch_input_shape": [
          null,
          8,
          28,
          28,
          1
        ],
        "trainable": true,
        "layer": {
          "class_name": "Conv2D",
          "config": {
            "dilation_rate": [
              1,
              1
            ],
            "bias_constraint": null,
            "bias_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "activity_regularizer": null,
            "kernel_regularizer": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "seed": null,
                "mode": "fan_avg",
                "scale": 1.0,
                "distribution": "uniform"
              }
            },
            "name": "conv2d_2",
            "dtype": "float32",
            "data_format": "channels_last",
            "batch_input_shape": [
              null,
              28,
              28,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "activation": "relu",
            "trainable": true,
            "use_bias": true
          }
        }
      }
    },
    {
      "class_name": "TimeDistributed",
      "config": {
        "name": "time_distributed_4",
        "layer": {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [
              2,
              2
            ],
            "name": "max_pooling2d_2",
            "data_format": "channels_last",
            "padding": "valid",
            "trainable": true,
            "strides": [
              2,
              2
            ]
          }
        },
        "trainable": true
      }
    },
    {
      "class_name": "TimeDistributed",
      "config": {
        "name": "time_distributed_5",
        "layer": {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true
          }
        },
        "trainable": true
      }
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_1",
        "layer": {
          "class_name": "GRU",
          "config": {
            "recurrent_constraint": null,
            "bias_regularizer": null,
            "units": 256,
            "dropout": 0.5,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "seed": null,
                "mode": "fan_avg",
                "scale": 1.0,
                "distribution": "uniform"
              }
            },
            "name": "gru_1",
            "recurrent_dropout": 0.0,
            "kernel_constraint": null,
            "unroll": false,
            "go_backwards": false,
            "trainable": true,
            "bias_constraint": null,
            "activity_regularizer": null,
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              }
            },
            "kernel_regularizer": null,
            "use_bias": true,
            "implementation": 0,
            "return_sequences": true,
            "stateful": false,
            "recurrent_activation": "hard_sigmoid",
            "activation": "relu",
            "recurrent_regularizer": null
          }
        },
        "merge_mode": "concat",
        "trainable": true
      }
    },
    {
      "class_name": "Bidirectional",
      "config": {
        "name": "bidirectional_2",
        "layer": {
          "class_name": "GRU",
          "config": {
            "recurrent_constraint": null,
            "bias_regularizer": null,
            "units": 256,
            "dropout": 0.5,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "seed": null,
                "mode": "fan_avg",
                "scale": 1.0,
                "distribution": "uniform"
              }
            },
            "name": "gru_2",
            "recurrent_dropout": 0.0,
            "kernel_constraint": null,
            "unroll": false,
            "go_backwards": false,
            "trainable": true,
            "bias_constraint": null,
            "activity_regularizer": null,
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              }
            },
            "kernel_regularizer": null,
            "use_bias": true,
            "implementation": 0,
            "return_sequences": true,
            "stateful": false,
            "recurrent_activation": "hard_sigmoid",
            "activation": "relu",
            "recurrent_regularizer": null
          }
        },
        "merge_mode": "concat",
        "trainable": true
      }
    },
    {
      "class_name": "TimeDistributed",
      "config": {
        "name": "time_distributed_6",
        "dtype": "float32",
        "batch_input_shape": [
          null,
          8,
          512
        ],
        "trainable": true,
        "layer": {
          "class_name": "Dense",
          "config": {
            "bias_constraint": null,
            "bias_regularizer": null,
            "units": 197,
            "activity_regularizer": null,
            "kernel_regularizer": null,
            "activation": "softmax",
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "seed": null,
                "mode": "fan_avg",
                "scale": 1.0,
                "distribution": "uniform"
              }
            },
            "name": "dense_1",
            "kernel_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "use_bias": true,
            "trainable": true
          }
        }
      }
    }
  ]
}