{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "TimeDistributed", "config": {"trainable": true, "batch_input_shape": [null, 8, 28, 28, 1], "dtype": "float32", "layer": {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_constraint": null, "dtype": "float32", "padding": "same", "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "filters": 16, "kernel_size": [5, 5], "name": "conv2d_1"}}, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1"}}, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "name": "time_distributed_3"}}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "bias_constraint": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "use_bias": true, "trainable": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "stateful": false, "implementation": 0, "recurrent_activation": "hard_sigmoid", "dropout": 0.5, "kernel_regularizer": null, "bias_regularizer": null, "units": 512, "kernel_constraint": null, "activation": "relu", "name": "gru_1"}}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "bias_constraint": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "use_bias": true, "trainable": true, "recurrent_dropout": 0.0, "activity_regularizer": null, "go_backwards": false, "stateful": false, "implementation": 0, "recurrent_activation": "hard_sigmoid", "dropout": 0.5, "kernel_regularizer": null, "bias_regularizer": null, "units": 512, "kernel_constraint": null, "activation": "relu", "name": "gru_2"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "batch_input_shape": [null, 8, 512], "dtype": "float32", "layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "units": 197, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1"}}, "name": "time_distributed_4"}}]}