{"keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 8, 28, 28, 1], "name": "time_distributed_1", "layer": {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "filters": 16, "data_format": "channels_last"}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 8, 28, 28, 1], "name": "time_distributed_3", "layer": {"class_name": "Conv2D", "config": {"bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "filters": 32, "data_format": "channels_last"}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_4", "layer": {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last"}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_5", "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_1", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"recurrent_constraint": null, "use_bias": true, "go_backwards": false, "dropout": 0.5, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "return_sequences": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 512, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "name": "gru_1", "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "unroll": false, "recurrent_regularizer": null, "stateful": false, "bias_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_2", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"recurrent_constraint": null, "use_bias": true, "go_backwards": false, "dropout": 0.5, "implementation": 0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "return_sequences": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 512, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "name": "gru_2", "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "unroll": false, "recurrent_regularizer": null, "stateful": false, "bias_constraint": null}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 8, 1024], "name": "time_distributed_6", "layer": {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "units": 197}}}}]}