{"class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "name": "conv2d_1", "strides": [1, 1], "filters": 16, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32"}}, "name": "time_distributed_1", "trainable": true, "batch_input_shape": [null, 8, 28, 28, 1], "dtype": "float32"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "padding": "valid", "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [4, 4]}}, "name": "time_distributed_2", "trainable": true}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, "name": "time_distributed_3", "trainable": true}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"kernel_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_constraint": null, "unroll": false, "bias_regularizer": null, "name": "gru_1", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "dropout": 0.5, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "go_backwards": false, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "stateful": false, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "bidirectional_1", "trainable": true, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"kernel_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_constraint": null, "unroll": false, "bias_regularizer": null, "name": "gru_2", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "dropout": 0.5, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "go_backwards": false, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "stateful": false, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "bidirectional_2", "trainable": true, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"kernel_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_constraint": null, "unroll": false, "bias_regularizer": null, "name": "gru_3", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "recurrent_regularizer": null, "implementation": 0, "dropout": 0.5, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "go_backwards": false, "activation": "relu", "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "stateful": false, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "bidirectional_3", "trainable": true, "merge_mode": "sum"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "units": 197, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null}}, "name": "time_distributed_4", "trainable": true, "batch_input_shape": [null, 8, 256], "dtype": "float32"}}], "keras_version": "2.0.4", "backend": "tensorflow"}