{"keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "name": "time_distributed_1", "batch_input_shape": [null, 8, 28, 28, 1], "layer": {"class_name": "Conv2D", "config": {"filters": 16, "kernel_constraint": null, "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "name": "time_distributed_3", "batch_input_shape": [null, 8, 28, 28, 1], "layer": {"class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu", "dilation_rate": [1, 1], "dtype": "float32", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_4", "layer": {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_5", "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"recurrent_dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "gru_1", "activation": "relu", "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null, "dropout": 0.5, "go_backwards": false, "kernel_constraint": null, "use_bias": true, "trainable": true, "stateful": false, "implementation": 0, "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null}}, "name": "bidirectional_1", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"recurrent_dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "gru_2", "activation": "relu", "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null, "dropout": 0.5, "go_backwards": false, "kernel_constraint": null, "use_bias": true, "trainable": true, "stateful": false, "implementation": 0, "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null}}, "name": "bidirectional_2", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"recurrent_dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "gru_3", "activation": "relu", "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null, "dropout": 0.5, "go_backwards": false, "kernel_constraint": null, "use_bias": true, "trainable": true, "stateful": false, "implementation": 0, "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null}}, "name": "bidirectional_3", "merge_mode": "sum"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "dtype": "float32", "name": "time_distributed_6", "batch_input_shape": [null, 8, 256], "layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "use_bias": true, "trainable": true, "units": 197, "name": "dense_1", "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}}}]}